[Killed] LogicalOperator
main/components/UCSBOrganization/UCSBOrganizationForm.js:81:44
                     isInvalid={Boolean(errors.inactive)}
                     {...register("inactive", {
                         required: "inactive is required.",
-                        validate: value => value === 'true' || value === 'false' || "The input should be just true or false" 
+                        validate: value => (value === 'true' || value === 'false') && "The input should be just true or false" 
                     })}
                 />
killedBy: UCSBOrganizationForm tests Displays error message for invalid 'inactive' input
statusReason: Error: Unable to find an element with the text: The input should be just true or false. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.js:81:44
                     isInvalid={Boolean(errors.inactive)}
                     {...register("inactive", {
                         required: "inactive is required.",
-                        validate: value => value === 'true' || value === 'false' || "The input should be just true or false" 
+                        validate: value => false 
                     })}
                 />
killedBy: UCSBOrganizationForm tests Displays error message for invalid 'inactive' input
statusReason: Error: Unable to find an element with the text: The input should be just true or false. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
