[Killed] ArrowFunction
main/components/UCSBOrganization/UCSBOrganizationTable.js:46:19
         {
             Header: 'inactive',
             accessor: 'inactive',
-            Cell: ({ value }) => value.toString()  // Explicitly convert boolean to string
+            Cell: () => undefined  // Explicitly convert boolean to string
 
         }
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:52:68
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "UCSBOrganizationTable"));
+        columns.push(ButtonColumn("Edit", "primary", editCallback, ""));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "UCSBOrganizationTable"));
     } 
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:53:35
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "UCSBOrganizationTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "UCSBOrganizationTable"));
+        columns.push(ButtonColumn("", "danger", deleteCallback, "UCSBOrganizationTable"));
     } 
 
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!
