[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:15:13
         useBackend(
             // Stryker disable next-line all : don't test internal caching of React Query
             [`/api/ucsborganization?orgCode=${orgCode}`],
-            {  // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-                method: "GET",
-                url: `/api/ucsborganization`,
-                params: {
-                    orgCode
-                }
-            }
+            {}
         );
 
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:18:25
             {  // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
                 method: "GET",
                 url: `/api/ucsborganization`,
-                params: {
-                    orgCode
-                }
+                params: {}
             }
         );
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:25:36
         );
 
 
-    const objectToAxiosPutParams = (organization) => ({
-        url: "/api/ucsborganization",
-        method: "PUT",
-        params: {
-            orgCode: organization.orgCode,
-        },
-        data: {
-            orgCode: organization.orgCode,
-            orgTranslationShort: organization.orgTranslationShort,
-            orgTranslation: organization.orgTranslation,
-            inactive: organization.inactive
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (organization) => {
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBOrganization Updated - orgCode: VSA1 orgTranslationShort: ASSC VIET STU orgTranslation: ASSOCIATION FOR VIETNAMESE STUDENTS inactive: true"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:31:15
         params: {
             orgCode: organization.orgCode,
         },
-        data: {
-            orgCode: organization.orgCode,
-            orgTranslationShort: organization.orgTranslationShort,
-            orgTranslation: organization.orgTranslation,
-            inactive: organization.inactive
-        }
+        data: {}
     });
 
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"orgCode\":\"VSA1\",\"orgTranslationShort\":\"ASSC VIET STU\",\"orgTranslation\":\"ASSOCIATION FOR VIETNAMESE STUDENTS\",\"inactive\":\"true\"}"
Received: "{}"
