[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:56:56
                                 id="itemId"
                                 type="text"
                                 isInvalid={Boolean(errors.itemId)}
-                                {...register("itemId", { required: "Item Id is required" })}
+                                {...register("itemId", {})}
                             />
                             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /itemId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:56:68
                                 id="itemId"
                                 type="text"
                                 isInvalid={Boolean(errors.itemId)}
-                                {...register("itemId", { required: "Item Id is required" })}
+                                {...register("itemId", { required: "" })}
                             />
                             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /itemId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:59:34
                                 {...register("itemId", { required: "Item Id is required" })}
                             />
                             <Form.Control.Feedback type="invalid">
-                                {errors.itemId && 'itemId is required.'}
+                                {true}
                                 {errors.itemId?.message}
                             </Form.Control.Feedback>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /itemId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/MenuItemReview/MenuItemReviewForm.js:60:34
                             />
                             <Form.Control.Feedback type="invalid">
                                 {errors.itemId && 'itemId is required.'}
-                                {errors.itemId?.message}
+                                {errors.itemId.message}
                             </Form.Control.Feedback>
                         </Form.Group>
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:73:39
                         type="text"
                         isInvalid={Boolean(errors.name)}
                         {...register("reviewerEmail", {
-                            required: "reviewerEmail is required."
+                            required: ""
                         })}
                     />
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /reviewerEmail is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:89:42
                             id="stars"
                             type="text"
                             isInvalid={Boolean(errors.itemId)}
-                            {...register("stars", { required: "Stars is required" })}
+                            {...register("", { required: "Stars is required" })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:89:51
                             id="stars"
                             type="text"
                             isInvalid={Boolean(errors.itemId)}
-                            {...register("stars", { required: "Stars is required" })}
+                            {...register("stars", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /stars is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:92:30
                             {...register("stars", { required: "Stars is required" })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.stars && 'stars is required.'}
+                            {errors.stars || 'stars is required.'}
                             {errors.stars?.message}
                         </Form.Control.Feedback>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:92:30
                             {...register("stars", { required: "Stars is required" })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.stars && 'stars is required.'}
+                            {true}
                             {errors.stars?.message}
                         </Form.Control.Feedback>
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /stars is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/MenuItemReview/MenuItemReviewForm.js:93:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.stars && 'stars is required.'}
-                            {errors.stars?.message}
+                            {errors.stars.message}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:109:30
                             {...register("dateReviewed", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateReviewed && 'dateReviewed is required in iso format.'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /dateReviewed is required in iso format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:109:30
                             {...register("dateReviewed", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateReviewed && 'dateReviewed is required in iso format.'}
+                            {errors.dateReviewed || 'dateReviewed is required in iso format.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:128:54
                             id="comments"
                             type="text"
                             isInvalid={Boolean(errors.name)}
-                            {...register("comments", {
-                                required: "comments are required."
-                            })}
+                            {...register("comments", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /comments are required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:129:43
                             type="text"
                             isInvalid={Boolean(errors.name)}
                             {...register("comments", {
-                                required: "comments are required."
+                                required: ""
                             })}
                         />
killedBy: MenuItemReviewForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /comments are required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
