[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:42:9
             Header: 'Name',
             accessor: 'name',
         },
-        {
-            Header: 'Dining Commons Code',
-            accessor: 'diningCommonsCode',
-        },
+        {},
         {
             Header: 'Station',
killedBy: UCSBDiningCommonsMenuItemTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:44:23
         },
         {
             Header: 'Dining Commons Code',
-            accessor: 'diningCommonsCode',
+            accessor: "",
         },
         {
killedBy: UCSBDiningCommonsMenuItemTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemTable-cell-row-0-col-diningCommonsCode"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
