[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:9:31
 
 export default function RestaurantCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (UCSBDiningCommonsMenuItem) => ({
-    url: "/api/UCSBDiningCommonsMenuItem/post",
-    method: "POST",
-    params: {
-     name: UCSBDiningCommonsMenuItem.name,
-     diningCommonsCode: UCSBDiningCommonsMenuItem.diningCommonsCode,
-     station: UCSBDiningCommonsMenuItem.station
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (UCSBDiningCommonsMenuItem) => {
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /UCSBDiningCommonsMenuItem
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:11:13
 
   const objectToAxiosParams = (UCSBDiningCommonsMenuItem) => ({
     url: "/api/UCSBDiningCommonsMenuItem/post",
-    method: "POST",
+    method: "",
     params: {
      name: UCSBDiningCommonsMenuItem.name,
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /UCSBDiningCommonsMenuItem
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:12:13
   const objectToAxiosParams = (UCSBDiningCommonsMenuItem) => ({
     url: "/api/UCSBDiningCommonsMenuItem/post",
     method: "POST",
-    params: {
-     name: UCSBDiningCommonsMenuItem.name,
-     diningCommonsCode: UCSBDiningCommonsMenuItem.diningCommonsCode,
-     station: UCSBDiningCommonsMenuItem.station
-    }
+    params: {}
   });
 
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /UCSBDiningCommonsMenuItem
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Object {
-   "diningCommonsCode": "Portola",
-   "name": "Bread",

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:19:52
     }
   });
 
-  const onSuccess = (UCSBDiningCommonsMenuItem) => {
-    toast(`New UCSB Dining Commons Menu Item created - id: ${UCSBDiningCommonsMenuItem.id} name: ${UCSBDiningCommonsMenuItem.name}`);
-  }
+  const onSuccess = (UCSBDiningCommonsMenuItem) => {}
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /UCSBDiningCommonsMenuItem
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New UCSB Dining Commons Menu Item created - id: 2 name: Bread"

Number of calls: 0
