[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemIndexPage.js:17:35
         useBackend(
             // Stryker disable next-line all : don't test internal caching of React Query
             ["/api/UCSBDiningCommonsMenuItem/all"],
-            { method: "GET", url: "/api/UCSBDiningCommonsMenuItem/all" },
+            { method: "GET", url: "" },
             // Stryker disable next-line all : don't test default value of empty list
             []
killedBy: UCSBDiningCommonsMenuItemIndexPage tests renders three UCSBDiningCommonsMenuItems correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemIndexPage.js:17:23
         useBackend(
             // Stryker disable next-line all : don't test internal caching of React Query
             ["/api/UCSBDiningCommonsMenuItem/all"],
-            { method: "GET", url: "/api/UCSBDiningCommonsMenuItem/all" },
+            { method: "", url: "/api/UCSBDiningCommonsMenuItem/all" },
             // Stryker disable next-line all : don't test default value of empty list
             []
killedBy: UCSBDiningCommonsMenuItemIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/UCSBDiningCommonsMenuItem/all"
Received string:    "Error communicating with backend via  on /api/UCSBDiningCommonsMenuItem/all"

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemIndexPage.js:22:32
             []
         );
 
-    const createButton = () => {
-        if (hasRole(currentUser, "ROLE_ADMIN")) {
-            return (
-                <Button
-                    variant="primary"
-                    href="/diningcommonsmenuitem/create"
-                    style={{ float: "right" }}
-                >
-                    Create UCSBDiningCommonsMenuItem
-                </Button>
-            )
-        } 
-    }
+    const createButton = () => {}
 
     return (
killedBy: UCSBDiningCommonsMenuItemIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create UCSBDiningCommonsMenuItem/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
